In [1]:
import numpy as np
import pandas as pd
df = pd.DataFrame({"name":["张三","李四","王五","小明"],
                   "sex":["female","male","male","female"],
                   "year":[2000,2002,2001,2003],
                   "city":["北京","西安","长沙","广州"]})# ,index=["学生1","学生2","学生3","学生4"]
# display(df)
# df1 = df.set_index('city')
# print(df.iloc[:3,2])
# print(df.loc[:'学生3',['name','year']])
# display(df.query('year>2002'))
df = df._append({'name':'刘六','sex':"female","year":2005,'city':'上海'},ignore_index=True)
# display(df)
df.insert(1,'no',["001","002","003","004","005"])
df['score'] = np.nan
df = df.set_index('city')
# df.drop('广州',inplace=True)
# df.drop('year',axis=1,inplace=True)
df.rename(columns={'no':"number"},inplace=True)
# df['score']=df['score'].bfill()
df['score']=df['score'].fillna(2)

display(df)

     name number     sex  year  score
city
北京     张三    001  female  2000    2.0
西安     李四    002    male  2002    2.0
长沙     王五    003    male  2001    2.0
广州     小明    004  female  2003    2.0
上海     刘六    005  female  2005    2.0

In [2]:
def f(x:str):
    return x.split('ale')[0]
df['sex']=df['sex'].map(f)
display(df)

     name number  sex  year  score
city
北京     张三    001  fem  2000    2.0
西安     李四    002    m  2002    2.0
长沙     王五    003    m  2001    2.0
广州     小明    004  fem  2003    2.0
上海     刘六    005  fem  2005    2.0

In [3]:
df1 = pd.DataFrame(np.random.random((3,3)),columns=list('abc'),index=['app',"win","mac"])
display(df1)
print(df1.apply(np.mean,axis=0))
print(df1.apply(np.mean,axis=1))
print(df1.applymap(lambda x: '%.3f'%x))

            a         b         c
app  0.070362  0.548698  0.541193
win  0.336341  0.775388  0.855961
mac  0.605526  0.851144  0.280705

a    0.337410
b    0.725077
c    0.559286
dtype: float64
app    0.386751
win    0.655897
mac    0.579125
dtype: float64
         a      b      c
app  0.070  0.549  0.541
win  0.336  0.775  0.856
mac  0.606  0.851  0.281

C:\Users\hxc\AppData\Local\Temp\ipykernel_30216\4101931154.py:5: FutureWarning: DataFrame.applymap has been deprecated. Use DataFrame.map instead.
  print(df1.applymap(lambda x: '%.3f'%x))

In [4]:
ser = pd.Series([1,-2,4,-4],index=['c','b','a','d'])
print(ser)
print(ser.sort_index(ascending=True))

c    1
b   -2
a    4
d   -4
dtype: int64
a    4
b   -2
c    1
d   -4
dtype: int64

In [39]:
df = pd.DataFrame({'key1':['a','a','b','b','a'],
                   'key2':['yes','no','yes','yes','no'],
                   'data1':np.random.randn(5),
                   'data2':np.random.randn(5),})
grouped = df['data1'].groupby(by=df['key1'])
display(df)
print(grouped.size())
print(grouped.mean())

  key1 key2     data1     data2
0    a  yes  1.148960 -1.350737
1    a   no -0.817252 -0.636925
2    b  yes -0.383801  0.972725
3    b  yes  0.907572  0.186235
4    a   no  0.059674 -2.094325

key1
a    3
b    2
Name: data1, dtype: int64
key1
a    0.130461
b    0.261886
Name: data1, dtype: float64

In [38]:
df = pd.DataFrame({
                   'key2':['yes','no','yes','yes','no'],
                   'data1':np.random.randn(5),
                   'data2':np.random.randn(5),})
groupk1 = df.groupby('key2').mean()
print(groupk1)

         data1     data2
key2
no    0.588389  0.481332
yes  -0.856138 -0.163214